In [1]:
import numpy as np
import pandas as pd

### Handling Missing Values (contd.)

In [2]:
mark_data = pd.read_csv('./data/marketing.csv')

In [3]:
mark_data.sample(5)

,Sex,MaritalStatus,Age,Education,Occupation,YearsInSf,DualIncome,HouseholdMembers,Under18,HouseholdStatus,TypeOfHome,EthnicClass,Language,Income
5750,2,1.0,3,3.0,1.0,5.0,2,2.0,0,1.0,1.0,5.0,1.0,4
467,2,3.0,3,4.0,1.0,NaN,1,2.0,1,2.0,1.0,7.0,1.0,6
8984,1,5.0,2,4.0,4.0,2.0,1,3.0,0,2.0,5.0,8.0,3.0,1
8709,1,1.0,4,6.0,1.0,NaN,2,3.0,0,1.0,1.0,7.0,1.0,9
3215,1,1.0,6,3.0,3.0,5.0,2,3.0,1,2.0,3.0,5.0,2.0,5


* What percentage of missing values for each column in the dataset?

In [4]:
mark_data.isnull()

,Sex,MaritalStatus,Age,Education,Occupation,YearsInSf,DualIncome,HouseholdMembers,Under18,HouseholdStatus,TypeOfHome,EthnicClass,Language,Income
0,False,False,False,False,False,False,False,False,False,False,False,False,True,False
1,False,False,False,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
8988,False,False,False,False,False,False,False,False,False,False,False,False,False,False
8989,False,False,False,False,False,False,False,False,False,False,False,False,False,False
8990,False,False,False,False,False,False,False,False,False,False,False,False,False,False
8991,False,False,False,False,False,False,False,False,False,False,False,False,False,False
8992,False,False,False,False,False,False,False,False,False,False,False,False,False,False

In [7]:
perc_miss_per_col = 100*mark_data.isnull().mean()
perc_miss_per_col

Sex                  0.000000
MaritalStatus        1.779162
Age                  0.000000
Education            0.956299
Occupation           1.512287
YearsInSf           10.152341
DualIncome           0.000000
HouseholdMembers     4.169910
Under18              0.000000
HouseholdStatus      2.668742
TypeOfHome           3.969754
EthnicClass          0.756144
Language             3.991994
Income               0.000000
dtype: float64



* Which attribute has the most missing values in the dataset? (**Hint**: To get the index of the maximum element you can use [`idxmax()`](https://pandas.pydata.org/pandas-docs/stable/generated/pandas.Series.idxmax.html) function)

In [8]:
perc_miss_per_col.max()

10.152340709440676

In [9]:
perc_miss_per_col.idxmax()

'YearsInSf'


* How do you fill the missing values with a `0`?

In [18]:
mark_data_fill_0 = mark_data.fillna(0)
mark_data_fill_0.sample(5)

,Sex,MaritalStatus,Age,Education,Occupation,YearsInSf,DualIncome,HouseholdMembers,Under18,HouseholdStatus,TypeOfHome,EthnicClass,Language,Income
2311,2,5.0,1,2.0,6.0,5.0,1,4.0,2,3.0,1.0,7.0,1.0,1
7432,2,3.0,6,5.0,1.0,5.0,1,3.0,0,1.0,1.0,7.0,1.0,4
4136,1,1.0,4,6.0,2.0,0.0,3,3.0,2,2.0,1.0,7.0,1.0,6
213,1,1.0,5,5.0,1.0,5.0,2,2.0,0,1.0,1.0,7.0,0.0,9
4560,1,2.0,2,3.0,1.0,3.0,3,5.0,0,2.0,2.0,2.0,3.0,5

* **Most Common Use**: Can you fill each missing value with the corresponding average for that attribute?
    * For example, if 'Education' attribute is missing for a person, can you find the average 'Education' of all people and fill that missing 'Age' with that average.

In [27]:
mark_data.sample(5)

,Sex,MaritalStatus,Age,Education,Occupation,YearsInSf,DualIncome,HouseholdMembers,Under18,HouseholdStatus,TypeOfHome,EthnicClass,Language,Income
2859,1,5.0,2,5.0,9.0,5.0,1,3.0,0,3.0,NaN,2.0,1.0,9
1340,1,3.0,4,3.0,3.0,2.0,1,NaN,0,2.0,3.0,7.0,1.0,4
1155,2,5.0,2,4.0,4.0,3.0,1,4.0,0,2.0,3.0,7.0,1.0,1
6583,2,1.0,3,5.0,1.0,5.0,2,2.0,0,1.0,5.0,7.0,1.0,8
5010,2,1.0,3,5.0,1.0,5.0,2,2.0,0,1.0,1.0,7.0,1.0,7

In [29]:
avg_per_col = mark_data.mean()
avg_per_col

Sex                 1.546870
MaritalStatus       3.031020
Age                 3.415212
Education           3.835074
Occupation          3.787964
YearsInSf           4.198267
DualIncome          1.544757
HouseholdMembers    2.851822
Under18             0.666852
HouseholdStatus     1.836742
TypeOfHome          1.855720
EthnicClass         5.955854
Language            1.127519
Income              4.895029
dtype: float64

In [30]:
mark_data_fill_avg = mark_data.fillna(avg_per_col)

In [49]:
mark_data_fill_avg.sample(5)

,Sex,MaritalStatus,Age,Education,Occupation,YearsInSf,DualIncome,HouseholdMembers,Under18,HouseholdStatus,TypeOfHome,EthnicClass,Language,Income
4629,2,5.0,5,4.000000,1.0,5.0,1,2.851822,0,2.000000,4.0,7.0,1.0,3
2935,2,4.0,7,3.835074,8.0,5.0,1,1.000000,0,1.836742,3.0,7.0,1.0,2
1179,2,5.0,3,6.000000,1.0,5.0,1,1.000000,0,2.000000,2.0,3.0,1.0,7
6228,2,1.0,3,4.000000,4.0,4.0,2,2.000000,0,1.000000,1.0,7.0,1.0,8
7214,1,4.0,7,4.000000,8.0,3.0,1,1.000000,0,2.000000,3.0,5.0,2.0,5

# Combining Pandas Datasets with Concatenation [MORE INFO](https://pandas.pydata.org/pandas-docs/stable/merging.html)

## Introduction

In [50]:
# For this tutorial, we will need college_loan_defaults dataset.
college_loan_defaults = pd.read_csv(
    './data/college-loan-default-rates.csv', index_col='opeid')

# Keep in mind that the original dataset has this many rows
len(college_loan_defaults)

4596

The Office of Postsecondary Education Identification (OPEID) code for each college is used as an index

In [51]:
college_loan_defaults.head()

,name,address,city,state,state_desc,zipcode,zipcode_ext,school_type_code,school_type_desc,year_1,...,year_1_borrowers_in_repay,year_1_default_rate,year_2,year_2_borrowers_in_default,year_2_borrowers_in_repay,year_2_default_rate,year_3,year_3_borrowers_in_default,year_3_borrowers_in_repay,year_3_default_rate
opeid,,,,,,,,,,,,,,,,,,,,,
31505,A - TECHNICAL COLLEGE,1033 SOUTH BROADWAY STREET,LOS ANGELES,CA,CALIFORNIA,90015,3535,3,PrivateForProfit,2013,...,92,27.1,2012,9.0,33.0,27.2,2011,11.0,35.0,31.4
41495,A & W HEALTHCARE EDUCATORS,6930 MARTIN DRIVE,NEW ORLEANS,LA,LOUISIANA,70126,2923,3,PrivateForProfit,2013,...,31,12.9,2012,5.0,31.0,16.1,2011,0.0,5.0,0.0
2477,A. T. STILL UNIVERSITY OF HEALTH SCIENCES,800 WEST JEFFERSON STREET,KIRKSVILLE,MO,MISSOURI,63501,1497,2,PrivateNonProfit,2013,...,837,1.6,2012,15.0,886.0,1.6,2011,24.0,763.0,3.1
30649,AARON'S ACADEMY OF BEAUTY,11690 DOOLITTLE DRIVE,WALDORF,MD,MARYLAND,20602,2715,3,PrivateForProfit,2013,...,106,35.8,2012,14.0,36.0,38.8,2011,18.0,41.0,43.9
30651,ABC BEAUTY COLLEGE,"203 SOUTH 26TH ST, SUITE B",ARKADELPHIA,AR,ARKANSAS,71923,4206,3,PrivateForProfit,2013,...,45,26.6,2012,10.0,52.0,19.2,2011,8.0,45.0,17.7

## `pd.concat`
You can think of the `pd.concat` function as the equivalent of the NumPy `concatenate` function for `Series` and `DataFrame` objects.

Will we spend most of our time on how these function works with `DataFrame` objects as opposed to `Series` objects since in practice that is how it is used most frequently.

When it comes to using the `pd.concat` function, the most basic question is whether you are adding *additional rows* or *additional columns*. We'll run through the function arguments based on concatenating rows and then come back for a look at how we perform column concatentations.

### Concatenating `DataFrame` Rows

In [52]:
# Here, I'll split the college_loan_defaults into multiple 
# sections of rows that we will then stiched back together.
part_1 = college_loan_defaults.iloc[:1000]
part_2 = college_loan_defaults.iloc[1000:2000]
part_3 = college_loan_defaults.iloc[1999:]

In [53]:
# This creates three parts:
# rows 0-999
# rows 1000-1999
# rows 1999-end -> notice 1999 appears twice
part_3.index & part_2.index

<ipython-input-53-48af3e9d1c1b>:5: FutureWarning: Index.__and__ operating as a set operation is deprecated, in the future this will be a logical operation matching Series.__and__.  Use index.intersection(other) instead
  part_3.index & part_2.index

Int64Index([1698], dtype='int64', name='opeid')

#### Basic Usage

In [54]:
# Join all three parts together pd.concat
concatenated_dataframe = pd.concat([part_3, part_1, part_2])
concatenated_dataframe.head()

,name,address,city,state,state_desc,zipcode,zipcode_ext,school_type_code,school_type_desc,year_1,...,year_1_borrowers_in_repay,year_1_default_rate,year_2,year_2_borrowers_in_default,year_2_borrowers_in_repay,year_2_default_rate,year_3,year_3_borrowers_in_default,year_3_borrowers_in_repay,year_3_default_rate
opeid,,,,,,,,,,,,,,,,,,,,,
1698,JOHN MARSHALL LAW SCHOOL (THE),315 SOUTH PLYMOUTH COURT,CHICAGO,IL,ILLINOIS,60604,3968,2,PrivateNonProfit,2013,...,530,0.9,2012,9.0,485.0,1.8,2011,8.0,491.0,1.6
41340,"JOHN PAOLO'S XTREME BEAUTY INSTITUTE, GOLDWELL...",2144 SARATOGA AVENUE,BALLSTON SPA,NY,NEW YORK,12020,1245,3,PrivateForProfit,2013,...,90,13.3,2012,11.0,68.0,16.1,2011,13.0,44.0,29.5
41657,"JOHN PAOLO'S XTREME BEAUTY, GOLDWELL PRODUCTS ...",638 COLUMBIA STREET EXTENSION,LATHAM,NY,NEW YORK,12110,3053,3,PrivateForProfit,2013,...,47,21.2,2012,5.0,24.0,20.8,2011,1.0,5.0,20.0
4004,JOHN TYLER COMMUNITY COLLEGE,13101 JEFFERSON DAVIS HIGHWAY,CHESTER,VA,VIRGINIA,23831,5316,1,Public,2013,...,1125,15.8,2012,131.0,938.0,13.9,2011,128.0,747.0,17.1
12813,JOHN WOOD COMMUNITY COLLEGE,1301 SOUTH 48TH STREET,QUINCY,IL,ILLINOIS,62305,401,1,Public,2013,...,552,18.2,2012,86.0,582.0,14.7,2011,89.0,565.0,15.7

In [55]:
print (concatenated_dataframe.shape[0])
print (part_1.shape[0], part_2.shape[0], part_3.shape[0])

4597
1000 1000 2597

<div class="alert alert-block alert-info">
Notice that `pd.concat` does not sort the elements of the DataFrame that it returns.
</div>

#### Handling Duplicate Index Values with `verify_integrity` & `ignore_index` Parameters
You probably didn't notice, but we got a school that is appearing twice in our list.

In [56]:
# The `DataFrame.index.duplicated` function returns a boolean array
# we can use as a mask to extract duplicate records.
concatenated_dataframe[concatenated_dataframe.index.duplicated()]

,name,address,city,state,state_desc,zipcode,zipcode_ext,school_type_code,school_type_desc,year_1,...,year_1_borrowers_in_repay,year_1_default_rate,year_2,year_2_borrowers_in_default,year_2_borrowers_in_repay,year_2_default_rate,year_3,year_3_borrowers_in_default,year_3_borrowers_in_repay,year_3_default_rate
opeid,,,,,,,,,,,,,,,,,,,,,
1698,JOHN MARSHALL LAW SCHOOL (THE),315 SOUTH PLYMOUTH COURT,CHICAGO,IL,ILLINOIS,60604,3968,2,PrivateNonProfit,2013,...,530,0.9,2012,9.0,485.0,1.8,2011,8.0,491.0,1.6

In [57]:
concatenated_dataframe.loc[1698]

,name,address,city,state,state_desc,zipcode,zipcode_ext,school_type_code,school_type_desc,year_1,...,year_1_borrowers_in_repay,year_1_default_rate,year_2,year_2_borrowers_in_default,year_2_borrowers_in_repay,year_2_default_rate,year_3,year_3_borrowers_in_default,year_3_borrowers_in_repay,year_3_default_rate
opeid,,,,,,,,,,,,,,,,,,,,,
1698,JOHN MARSHALL LAW SCHOOL (THE),315 SOUTH PLYMOUTH COURT,CHICAGO,IL,ILLINOIS,60604,3968,2,PrivateNonProfit,2013,...,530,0.9,2012,9.0,485.0,1.8,2011,8.0,491.0,1.6
1698,JOHN MARSHALL LAW SCHOOL (THE),315 SOUTH PLYMOUTH COURT,CHICAGO,IL,ILLINOIS,60604,3968,2,PrivateNonProfit,2013,...,530,0.9,2012,9.0,485.0,1.8,2011,8.0,491.0,1.6

**NOTE**: See how concatenated_dataframe.loc[1698] is using the explit index OPEID to select column(s). Since, we have two rows with the same index (opeid) in the concatenated_dataframe, we get two rows displayed above.

Now, I purposefully caused this problem for us (by including the 1999 indexed element in both `part_2` and `part_3`; but in the real world this is pretty common!

Sometimes you might want to keep both entries (often the case if the index value is the same but the rest of the data is different). If so, you can pass the **`ignore_index`** parameter with a value of **`True`** to the function and **all existing index values will be destroyed** and a new one integer based one will be created for you.

In [58]:
concatenated_dataframe = pd.concat([part_2, part_3, part_1], ignore_index=True)
concatenated_dataframe.head()

,name,address,city,state,state_desc,zipcode,zipcode_ext,school_type_code,school_type_desc,year_1,...,year_1_borrowers_in_repay,year_1_default_rate,year_2,year_2_borrowers_in_default,year_2_borrowers_in_repay,year_2_default_rate,year_3,year_3_borrowers_in_default,year_3_borrowers_in_repay,year_3_default_rate
0,COLUMBUS COLLEGE OF ART & DESIGN,60 CLEVELAND AVENUE,COLUMBUS,OH,OHIO,43215,1758,2,PrivateNonProfit,2013,...,348,11.4,2012,30.0,377.0,7.9,2011,38.0,371.0,10.2
1,COLUMBUS STATE COMMUNITY COLLEGE,550 EAST SPRING STREET,COLUMBUS,OH,OHIO,43215,1786,1,Public,2013,...,11464,19.3,2012,2627.0,12290.0,21.3,2011,2120.0,9911.0,21.3
2,COLUMBUS STATE UNIVERSITY,4225 UNIVERSITY AVENUE,COLUMBUS,GA,GEORGIA,31907,5645,1,Public,2013,...,2396,8.1,2012,189.0,2148.0,8.7,2011,217.0,1890.0,11.4
3,COLUMBUS TECHNICAL COLLEGE,928 MANCHESTER EXPRESSWAY,COLUMBUS,GA,GEORGIA,31904,6572,1,Public,2013,...,523,19.3,2012,2.0,12.0,16.6,2011,0.0,0.0,0.0
4,COMMONWEALTH INSTITUTE OF FUNERAL SERVICE,415 BARREN SPRINGS DRIVE,HOUSTON,TX,TEXAS,77090,5918,2,PrivateNonProfit,2013,...,142,5.6,2012,8.0,113.0,7.0,2011,6.0,84.0,7.1

If on the other hand, a duplicate index would mean there is a data problem that you don't want to allow, you can specify the `verify_integrity` parameter as `True`.

When this is passed, the existence of duplicate indices will generate a `ValueError` exception.

In [59]:
concatenated_dataframe = pd.concat([part_2, part_3, part_1], verify_integrity=True)

ValueError: Indexes have overlapping values: Int64Index([1698], dtype='int64', name='opeid')

#### Handling Column Mismatches with the `join` Parameter
Sometimes you will have two sets of rows that you want to join together, but the sets don't have all of the same columns.

I'll create a couple of additional small `DataFrame` objects from our college loan dataset to demonstrate our options here.

In [60]:
# DataFrame 1
# Contains the first 5 rows of the original dataset
# But only the name, city, and state columns
name_city_state_columns_only = college_loan_defaults[['name', 'city', 'state']].iloc[:5]

# DataFrame 2
# Contains the second 5 rows of the original dataset
# But only the name, state, and zipcode columns
name_state_zipcode_columns_only = college_loan_defaults[['name', 'state', 'zipcode']].iloc[5:10]

In [61]:
name_city_state_columns_only

                                            name         city state
opeid
31505                      A - TECHNICAL COLLEGE  LOS ANGELES    CA
41495                 A & W HEALTHCARE EDUCATORS  NEW ORLEANS    LA
2477   A. T. STILL UNIVERSITY OF HEALTH SCIENCES   KIRKSVILLE    MO
30649                  AARON'S ACADEMY OF BEAUTY      WALDORF    MD
30651                         ABC BEAUTY COLLEGE  ARKADELPHIA    AR

In [62]:
name_state_zipcode_columns_only

                                                    name state  zipcode
opeid
41833                                   ABCOTT INSTITUTE    MI    48075
37834                              ABDILL CAREER COLLEGE    OR    97504
3537                        ABILENE CHRISTIAN UNIVERSITY    TX    79699
7087   ABINGTON MEMORIAL HOSPITAL DIXON SCHOOL OF NUR...    PA    19090
1541                ABRAHAM BALDWIN AGRICULTURAL COLLEGE    GA    31793

We have have 2 sets of 5 rows that we want to concatenate together, but they have different columns. Let's see what happens if you don't specify anything with the **`join`** parameter.

In [63]:
pd.concat([name_city_state_columns_only, name_state_zipcode_columns_only])

,name,city,state,zipcode
opeid,,,,
31505,A - TECHNICAL COLLEGE,LOS ANGELES,CA,NaN
41495,A & W HEALTHCARE EDUCATORS,NEW ORLEANS,LA,NaN
2477,A. T. STILL UNIVERSITY OF HEALTH SCIENCES,KIRKSVILLE,MO,NaN
30649,AARON'S ACADEMY OF BEAUTY,WALDORF,MD,NaN
30651,ABC BEAUTY COLLEGE,ARKADELPHIA,AR,NaN
41833,ABCOTT INSTITUTE,NaN,MI,48075.0
37834,ABDILL CAREER COLLEGE,NaN,OR,97504.0
3537,ABILENE CHRISTIAN UNIVERSITY,NaN,TX,79699.0
7087,ABINGTON MEMORIAL HOSPITAL DIXON SCHOOL OF NUR...,NaN,PA,19090.0
1541,ABRAHAM BALDWIN AGRICULTURAL COLLEGE,NaN,GA,31793.0

See how Pandas adds the special `NaN` value for any column that didn't have a value in the original dataframes? 

The other option is to drop any columns where there is not data in both sets of rows. You can do this be specifying a value of **`inner`** to the join parameter of the function.

Let's demonstrate how doing so will result in only the shared columns (name, state) appearing in the final dataframe.

In [64]:
pd.concat([name_city_state_columns_only, name_state_zipcode_columns_only], join='inner')

                                                    name state
opeid
31505                              A - TECHNICAL COLLEGE    CA
41495                         A & W HEALTHCARE EDUCATORS    LA
2477           A. T. STILL UNIVERSITY OF HEALTH SCIENCES    MO
30649                          AARON'S ACADEMY OF BEAUTY    MD
30651                                 ABC BEAUTY COLLEGE    AR
41833                                   ABCOTT INSTITUTE    MI
37834                              ABDILL CAREER COLLEGE    OR
3537                        ABILENE CHRISTIAN UNIVERSITY    TX
7087   ABINGTON MEMORIAL HOSPITAL DIXON SCHOOL OF NUR...    PA
1541                ABRAHAM BALDWIN AGRICULTURAL COLLEGE    GA

### Concatenating `DataFrame` Columns
Now let's go back and see how we can use the `pd.concat` function to merge two sets of columns with the same index (row) values.

The data will start out a little dirty but we will clean it up with our parameters.

In [65]:
# DataFrame 1
# Contains the first 5 rows of the original dataset
# But only the name, city, and state columns
name_city_state_columns = college_loan_defaults[['name', 'city', 'state']].iloc[:5]

# DataFrame 2
# Contains the 7 rows of the original dataset - this will cause a duplicate index
# But only default rates columns
default_rates = college_loan_defaults[
    ['year_1_default_rate',
     'year_2_default_rate', 
     'year_3_default_rate']].iloc[:7]

In [66]:
name_city_state_columns

                                            name         city state
opeid
31505                      A - TECHNICAL COLLEGE  LOS ANGELES    CA
41495                 A & W HEALTHCARE EDUCATORS  NEW ORLEANS    LA
2477   A. T. STILL UNIVERSITY OF HEALTH SCIENCES   KIRKSVILLE    MO
30649                  AARON'S ACADEMY OF BEAUTY      WALDORF    MD
30651                         ABC BEAUTY COLLEGE  ARKADELPHIA    AR

In [67]:
default_rates

       year_1_default_rate  year_2_default_rate  year_3_default_rate
opeid
31505                 27.1                 27.2                 31.4
41495                 12.9                 16.1                  0.0
2477                   1.6                  1.6                  3.1
30649                 35.8                 38.8                 43.9
30651                 26.6                 19.2                 17.7
41833                 16.4                 15.1                  0.0
37834                 17.1                 20.7                 19.6

Now let's do a simple concatenation. To add columns we have to specify the `axis` parameter with a value of **`1`** or **`col`** to indicate we are adding colums, not rows.

In [68]:
pd.concat(
    [name_city_state_columns, default_rates], 
    axis=1)

,name,city,state,year_1_default_rate,year_2_default_rate,year_3_default_rate
opeid,,,,,,
2477,A. T. STILL UNIVERSITY OF HEALTH SCIENCES,KIRKSVILLE,MO,1.6,1.6,3.1
30649,AARON'S ACADEMY OF BEAUTY,WALDORF,MD,35.8,38.8,43.9
30651,ABC BEAUTY COLLEGE,ARKADELPHIA,AR,26.6,19.2,17.7
31505,A - TECHNICAL COLLEGE,LOS ANGELES,CA,27.1,27.2,31.4
37834,NaN,NaN,NaN,17.1,20.7,19.6
41495,A & W HEALTHCARE EDUCATORS,NEW ORLEANS,LA,12.9,16.1,0.0
41833,NaN,NaN,NaN,16.4,15.1,0.0

<div class="alert alert-block alert-info">
<p>
Note that the ``pd.concat()`` function is smart to match the rows based on the index `opeid`.  
</div>

There are a couple of important things to notice here:
* Unlike when concatenating rows, this time Pandas did **sort the rows based on the index**. Just something to be aware of.
* See how there are a couple of rows with `NaN` values for their first three colums.  That's because our `name_and_default_rates` dataframe had two additional rows for which there were no corresponding values in `name_city_state_zipcode_columns`.

Let's drop the rows with `NaN` values by specifying an inner join.

In [69]:
pd.concat(
    [name_city_state_columns, default_rates], 
    axis=1, join='inner')

,name,city,state,year_1_default_rate,year_2_default_rate,year_3_default_rate
opeid,,,,,,
31505,A - TECHNICAL COLLEGE,LOS ANGELES,CA,27.1,27.2,31.4
41495,A & W HEALTHCARE EDUCATORS,NEW ORLEANS,LA,12.9,16.1,0.0
2477,A. T. STILL UNIVERSITY OF HEALTH SCIENCES,KIRKSVILLE,MO,1.6,1.6,3.1
30649,AARON'S ACADEMY OF BEAUTY,WALDORF,MD,35.8,38.8,43.9
30651,ABC BEAUTY COLLEGE,ARKADELPHIA,AR,26.6,19.2,17.7

Finally, let's talk about the how the **`verify_integrity`** and **`ignore_index`** parameters would work when concatenating columns.

Let's say that we had included the city column in both dataframes:
* The default behavior of `pd.concat` would have been to create a new dataframe with 2 "city" columns.
* You could make Pandas throw a `ValueError` exception by passing `verify_integrity=True` to the function.
* You could also throw out all the column names and replace them with an 0-based series of integers.  This would result in the values of "city" being duplicated in two columns, but the columns would have different integer "names".

# Combining Datasets with Merge [MORE INFO](https://pandas.pydata.org/pandas-docs/stable/merging.html)

We will be exploring another way to combine datasets through the **`pd.merge`** function.

Those who have a background in databases will find a significant amount of overlap between your SQL work and the merge function.

## The 3 Categories of Joins
There are 3 different categories of merges/joins which are defined by the characteristics of the shared columns/indices:
* One-to-One: Each shared value exists only once in both dataframes.
* One-to-Many: A given shared value exists once in first dataframe, but 1 or more times in the second dateframe.
* Many-to-Many: A given shared value exists 1 or more times in both dataframes.

Let's provide an example of each type of join from our datasets.

### One-to-One Join

<div class="alert alert-block alert-info">
<p>
This will feel pretty similar to concatenating columns.
</p>
</div>

In [70]:
# Team Members Favorite Restaurants
team_restaurants = pd.DataFrame(
    {'restaurant': ['In-N-Out', 'Chipotle', 'Chick-Fil-A'], 
    'name': ['Mike', 'Kim', 'Roger']})
team_restaurants

    restaurant   name
0     In-N-Out   Mike
1     Chipotle    Kim
2  Chick-Fil-A  Roger

In [71]:
# Team Members Favorite Restaurants
items_locations = pd.DataFrame(
    {'items': ['Fries', 'Pizza', 'Barritos','Pasta', 'Shakes'], 
    'locations': ['Chicago', 'New York', 'San Diego', 'Pittsburgh', 'Seattle']})
items_locations

      items   locations
0     Fries     Chicago
1     Pizza    New York
2  Barritos   San Diego
3     Pasta  Pittsburgh
4    Shakes     Seattle

In [72]:
# Restaurant Items
restaurant_items = pd.DataFrame(
    {
        'item': [
        'Shakes', 
        'Burritos', 
        'Burger'
        ]
    ,
        'restaurant':[
        'In-N-Out',
        'Chipotle',
        'Five Guys',
    ]
    }
)
restaurant_items

       item restaurant
0    Shakes   In-N-Out
1  Burritos   Chipotle
2    Burger  Five Guys

In [73]:
team_restaurants

    restaurant   name
0     In-N-Out   Mike
1     Chipotle    Kim
2  Chick-Fil-A  Roger

The **`restaurant`** field in the restuarant_items, team_restaurants dataset is a unique field, that is it the restaurant names appear only once in each dataset. 

Because of this, if we merge the two dataframes it will be a **1-1 join.**

In [74]:
pd.merge(team_restaurants, restaurant_items)

  restaurant  name      item
0   In-N-Out  Mike    Shakes
1   Chipotle   Kim  Burritos

Great. Here's what Pandas did:
1. Identified the matching column(s) between the two dataframes: **`restaurant`**.
1. Found matching **`restaurant`** values between the two dataframes.
1. Merged the columns of matching **`restuarant`** values together.
1. **Important**: Notice that a new index was generated.

<div class="alert alert-block alert-info">
<p>
In our discussion, we will reference to the columns that pandas is using to find matches between dataframes as the "join column(s)".
</p>
</div>

#### Controlling the Join Type with the `how` Parameter
Did you notice that some of the records from each of the original dataframes didn't make it into the merge product?

This is because the type of join that was applied to the dataframes was called an **inner join**.

The are actually 4 types of joins that you can use:
* **Inner Join**: To be included in the output dataframe, the join column(s) value must exist in both original dataframes. 
    * This is why some of the records didn't get included in the output, because they didn't have a corresponding join column(s) values in the other dataframe.
* **Outer Join**: All records from both dataframes are included in the output. Pandas simply fills in `NaN` where there is no corresponding join column(s) value.
* **Left Join**: All rows from the first (left) dataframe will be included in the output dataframe, regardless of whether there is a matching join column(s) value in the second (right) dataframe.
* **Right Join**: All rows from the second (right) dataframe will be included in the output dataframe, regardless of whether there is a matching join columns value in the left (first) dataframe.

Let's go ahead and try all these different types of joins to see how our output changes.

In [75]:
team_restaurants

    restaurant   name
0     In-N-Out   Mike
1     Chipotle    Kim
2  Chick-Fil-A  Roger

In [76]:
restaurant_items

       item restaurant
0    Shakes   In-N-Out
1  Burritos   Chipotle
2    Burger  Five Guys

In [77]:
# Outer Join
# All records from both dataframes are included.
# NaN is inserted into missing grid point.
pd.merge(team_restaurants, restaurant_items, how="outer")

    restaurant   name      item
0     In-N-Out   Mike    Shakes
1     Chipotle    Kim  Burritos
2  Chick-Fil-A  Roger       NaN
3    Five Guys    NaN    Burger

In [78]:
pd.merge(team_restaurants, restaurant_items, how="left")

    restaurant   name      item
0     In-N-Out   Mike    Shakes
1     Chipotle    Kim  Burritos
2  Chick-Fil-A  Roger       NaN

In [79]:
pd.merge(team_restaurants, restaurant_items, how="right")

  restaurant  name      item
0   In-N-Out  Mike    Shakes
1   Chipotle   Kim  Burritos
2  Five Guys   NaN    Burger

### One-to-Many Join

In [80]:
# Restaurant Items
restaurant_items = pd.DataFrame(
    {
        'item': [
        'Burgers', 'Fries', 'Shakes', 
        'Tacos', 'Burritos', 'Chips',
        'Chicken Sandwich', 'Fries', 'Salads'
        ]
    ,
        'rest':[
        'In-N-Out', 'In-N-Out', 'In-N-Out', 
        'Chipotle', 'Chipotle', 'Chipotle',
        'Five Guys', 'Five Guys', 'Five Guys'
    ]
    }
)
restaurant_items

               item       rest
0           Burgers   In-N-Out
1             Fries   In-N-Out
2            Shakes   In-N-Out
3             Tacos   Chipotle
4          Burritos   Chipotle
5             Chips   Chipotle
6  Chicken Sandwich  Five Guys
7             Fries  Five Guys
8            Salads  Five Guys

In [81]:
team_restaurants

    restaurant   name
0     In-N-Out   Mike
1     Chipotle    Kim
2  Chick-Fil-A  Roger

In [82]:
pd.merge(team_restaurants, restaurant_items)

MergeError: No common columns to perform merge on. Merge options: left_on=None, right_on=None, left_index=False, right_index=False

#### Specifying the Join Columns
Well... that isn't want we wanted.

Thankfully though, the error message is pretty self-explanatory. Pandas thinks there are no common columns to merge on.

The reason for this is that the common values are held in columns with slightly different names. We have to explain to Pandas what to do when this happens by specifying the names of the columns to join on.

In [83]:
team_restaurants

    restaurant   name
0     In-N-Out   Mike
1     Chipotle    Kim
2  Chick-Fil-A  Roger

In [84]:
restaurant_items

               item       rest
0           Burgers   In-N-Out
1             Fries   In-N-Out
2            Shakes   In-N-Out
3             Tacos   Chipotle
4          Burritos   Chipotle
5             Chips   Chipotle
6  Chicken Sandwich  Five Guys
7             Fries  Five Guys
8            Salads  Five Guys

In [ ]:
# Use the left_on and right_on parameters to specify the
# name(s) of the join column(s) in the first(left)
# and second(right) dataframes.
pd.merge(
    team_restaurants, 
    restaurant_items,
    left_on='restaurant',
    right_on='rest')

<div class="alert alert-block alert-info">
<h5>There can be more than 1 join column</h5>
<p>
In this example, we have specified only one join column. But you can specify multiple columns if you so desire. Just pass them as a list to the `left_on` and `right_on` parameters.
</p>
</div>

### Many-to-Many Join

In [85]:
# Team Members Favorite Restaurants
team_restaurants = pd.DataFrame(
    {'restaurant': ['In-N-Out', 'Chipotle', 'Chick-Fil-A', 'Chick-Fil-A', 'In-N-Out'], 
    'name': ['Mike', 'Kim', 'Roger', 'Sam', 'Sonia']})
team_restaurants

    restaurant   name
0     In-N-Out   Mike
1     Chipotle    Kim
2  Chick-Fil-A  Roger
3  Chick-Fil-A    Sam
4     In-N-Out  Sonia

In [86]:
# Restaurant Items
restaurant_items = pd.DataFrame(
    {
        'item': [
        'Burgers', 'Fries', 'Shakes', 
        'Tacos', 'Burritos', 'Chips',
        'Chicken Sandwich', 'Fries', 'Salads'
        ]
    ,
        'rest':[
        'In-N-Out', 'In-N-Out', 'In-N-Out', 
        'Chipotle', 'Chipotle', 'Chipotle',
        'Five Guys', 'Five Guys', 'Five Guys'
    ]
    }
)
restaurant_items

               item       rest
0           Burgers   In-N-Out
1             Fries   In-N-Out
2            Shakes   In-N-Out
3             Tacos   Chipotle
4          Burritos   Chipotle
5             Chips   Chipotle
6  Chicken Sandwich  Five Guys
7             Fries  Five Guys
8            Salads  Five Guys

In [87]:
pd.merge(team_restaurants, restaurant_items, left_on = 'restaurant', right_on = 'rest', how = "outer")

     restaurant   name              item       rest
0      In-N-Out   Mike           Burgers   In-N-Out
1      In-N-Out   Mike             Fries   In-N-Out
2      In-N-Out   Mike            Shakes   In-N-Out
3      In-N-Out  Sonia           Burgers   In-N-Out
4      In-N-Out  Sonia             Fries   In-N-Out
5      In-N-Out  Sonia            Shakes   In-N-Out
6      Chipotle    Kim             Tacos   Chipotle
7      Chipotle    Kim          Burritos   Chipotle
8      Chipotle    Kim             Chips   Chipotle
9   Chick-Fil-A  Roger               NaN        NaN
10  Chick-Fil-A    Sam               NaN        NaN
11          NaN    NaN  Chicken Sandwich  Five Guys
12          NaN    NaN             Fries  Five Guys
13          NaN    NaN            Salads  Five Guys

<div class="alert alert-block alert-info">
<p> You could merge two dataframes based on index as well. </p>

<p>
If you wanted to, you could actually use the index of one dataframe and a column of the other dataframe if you wanted. Pandas gives you great flexibility here. 
</p>
</div>

## Activity: Compute the population density of each state

We will learn ``pd.merge()`` operation using the three datasets from your textbook.

* Load the datasets

In [88]:
pop = pd.read_csv('./data/state-population.csv')
areas = pd.read_csv('./data/state-areas.csv')
abbrevs = pd.read_csv('./data/state-abbrevs.csv')

In [89]:
pop.head()

  state_abrv     ages  year  population
0         AL  under18  2012   1117489.0
1         AL    total  2012   4817528.0
2         AL  under18  2010   1130966.0
3         AL    total  2010   4785570.0
4         AL  under18  2011   1125763.0

In [90]:
areas.head()

        state  area (sq. mi)
0     Alabama          52423
1      Alaska         656425
2     Arizona         114006
3    Arkansas          53182
4  California         163707

In [91]:
abbrevs.head()

        state abbreviation
0     Alabama           AL
1      Alaska           AK
2     Arizona           AZ
3    Arkansas           AR
4  California           CA

* Create a DataFrame named `areas_abbrvs_merged` by merging the ``areas`` DataFrame and ``abbrevs`` DataFrame to get the state names, state abbreviations, and area into one DataFrame

In [92]:
areas.head()

        state  area (sq. mi)
0     Alabama          52423
1      Alaska         656425
2     Arizona         114006
3    Arkansas          53182
4  California         163707

In [93]:
abbrevs.head()

        state abbreviation
0     Alabama           AL
1      Alaska           AK
2     Arizona           AZ
3    Arkansas           AR
4  California           CA

In [94]:
areas_abbrvs_merged = pd.merge(areas, abbrevs)
areas_abbrvs_merged.head()

        state  area (sq. mi) abbreviation
0     Alabama          52423           AL
1      Alaska         656425           AK
2     Arizona         114006           AZ
3    Arkansas          53182           AR
4  California         163707           CA

In [95]:
pop.head()

  state_abrv     ages  year  population
0         AL  under18  2012   1117489.0
1         AL    total  2012   4817528.0
2         AL  under18  2010   1130966.0
3         AL    total  2010   4785570.0
4         AL  under18  2011   1125763.0

* Merge the DataFrame created above (`areas_abbrvs_merged`) with the `pop` DataFrame to create a the `desired_data` DataFrame

In [97]:
desired_data = pd.merge(areas_abbrvs_merged, pop, left_on = 'abbreviation', right_on = 'state_abrv')
desired_data.head()

     state  area (sq. mi) abbreviation state_abrv     ages  year  population
0  Alabama          52423           AL         AL  under18  2012   1117489.0
1  Alabama          52423           AL         AL    total  2012   4817528.0
2  Alabama          52423           AL         AL  under18  2010   1130966.0
3  Alabama          52423           AL         AL    total  2010   4785570.0
4  Alabama          52423           AL         AL  under18  2011   1125763.0

* Finally, create a column called density using the `population` and `area (sq. mi)` columns.

In [99]:
desired_data['density'] = desired_data['population'] / desired_data['area (sq. mi)']
desired_data.head()

,state,area (sq. mi),abbreviation,state_abrv,ages,year,population,density
0,Alabama,52423,AL,AL,under18,2012,1117489.0,21.316769
1,Alabama,52423,AL,AL,total,2012,4817528.0,91.897221
2,Alabama,52423,AL,AL,under18,2010,1130966.0,21.573851
3,Alabama,52423,AL,AL,total,2010,4785570.0,91.287603
4,Alabama,52423,AL,AL,under18,2011,1125763.0,21.474601

* Which state has highest 'total' population density in year 2012?

In [100]:
# Step 1: Filter out the data with ages is 'total' and year is 2012
mask_tot_2012 = (desired_data['ages'] == 'total') & ( desired_data['year'] == 2012 )
desired_data_tot_2012 = desired_data[mask_tot_2012]
desired_data_tot_2012.head()

,state,area (sq. mi),abbreviation,state_abrv,ages,year,population,density
1,Alabama,52423,AL,AL,total,2012,4817528.0,91.897221
95,Alaska,656425,AK,AK,total,2012,730307.0,1.112552
97,Arizona,114006,AZ,AZ,total,2012,6551149.0,57.463195
191,Arkansas,53182,AR,AR,total,2012,2949828.0,55.466662
193,California,163707,CA,CA,total,2012,37999878.0,232.121278

In [102]:
# Step 2: Find the maximum pop density in the filtered dataframe
max_density = desired_data_tot_2012['density'].max()
max_density

9315.10294117647

In [103]:
# Step 3: Find the state that has the maximum pop density
mask_max_density = desired_data_tot_2012['density'] == max_density
desired_data_tot_2012[mask_max_density]

,state,area (sq. mi),abbreviation,state_abrv,ages,year,population,density
2401,District of Columbia,68,DC,DC,total,2012,633427.0,9315.102941

**Alternate way**

In [104]:
# Select the index where max occurred
index_max = desired_data_tot_2012['density'].idxmax()
index_max

2401

In [107]:
# Now use the explicit index shown in the above cell to extract the corresponding row and select he column name 'state'
desired_data_tot_2012.loc[index_max]['state']

'District of Columbia'

In [110]:
# Select the index where max occurred
index_min = desired_data_tot_2012['density'].idxmin()
index_min

95

In [111]:
# Now use the explicit index shown in the above cell to extract the corresponding row and select he column name 'state'
desired_data_tot_2012.loc[index_min]['state']

'Alaska'

# Writing files back 

Until now you have been loading the dataset from your computer, however, you might want to store the data back to the computer to use it later. 

For example, in the above activity were you created population density by merging bunch of DataFrames, you might want to save that DataFrame, rather than redoing all the steps.

## pd.DataFrame.to_csv()

In [ ]:
pd.DataFrame.to_csv?

In [108]:
desired_data.to_csv('./data/state-population-density.csv')

<div class="alert alert-block alert-info">
<p>
``to_csv()`` by default writes the index (row names) as well. This will create an additional column with the indexes. If you want to avoid it, you can use keyword parameter ``index = False`` to avoid creating a column for the index. 
</p>
</div>

In [109]:
desired_data.to_csv('./data/state-population-density.csv', index = False)

# Hierarchical Indexing

### Multiindex

If you set an index to more than one columnn you are creating multi index or Hieararchical index. This makes asking questions based on indexes a lot more easier, and also opens the possibility of working with multidimensional data. 

We'll use the example sourced from [here](https://chrisalbon.com/python/pandas_hierarchical_data.html).

In [ ]:
# Create dataframe
raw_data = {'regiment': ['Nighthawks', 'Nighthawks', 'Nighthawks', 'Nighthawks', 'Dragoons', 'Dragoons', 'Dragoons', 'Dragoons', 'Scouts', 'Scouts', 'Scouts', 'Scouts'], 
        'company': ['1st', '1st', '2nd', '2nd', '1st', '1st', '2nd', '2nd','1st', '1st', '2nd', '2nd'], 
        'name': ['Miller', 'Jacobson', 'Ali', 'Milner', 'Cooze', 'Jacon', 'Ryaner', 'Sone', 'Sloan', 'Piger', 'Riani', 'Ali'], 
        'preTestScore': [4, 24, 31, 2, 3, 4, 24, 31, 2, 3, 2, 3],
        'postTestScore': [25, 94, 57, 62, 70, 25, 94, 57, 62, 70, 62, 70]}
df = pd.DataFrame(raw_data, columns = ['regiment', 'company', 'name', 'preTestScore', 'postTestScore'])
df

In [ ]:
df_1_ind = df.set_index('regiment')
df_1_ind

* How do we get the average scores, based on the regiment?

In [ ]:
df_1_ind.mean(level = 'regiment')

* How about you want to get the mean scores, based on the company but not the regiment?

In [ ]:
# Set the hierarchical index to be by regiment, and then by company
df_2_ind = df.set_index(['regiment', 'company'])
df_2_ind

<div class="alert alert-block alert-info">
<p>
Having multiple indexes will give you an easy way to model more than two dimensional data with DataFrames, which are by default a two dimensional data structures. 
</p>
<p>
For the above example, you can imagine each regiment is a two-dimensional array giving details about the company, names and the scores, and they are stacked one below the other. 
</p>
</div>

In [ ]:
df_2_ind.mean(level='company')

In [ ]:
df_2_ind.mean(level='regiment')

In [ ]:
df_2_ind.mean(level=['regiment','company'])

### Concatenating two or more `Series` to a `DataFrame` with `axis = 1` parameter in `pd.concat()` function

In [ ]:
s1 = pd.Series([1, 2], index=['A', 'B'], name='s1')
s2 = pd.Series([3, 4,5], index=['A', 'B','C'], name='s2')

In [ ]:
s1

In [ ]:
s2

In [ ]:
pd.concat([s1, s2], axis=1)

<div class="alert alert-block alert-info">
<p>
Note that the ``pd.concat()`` function is smart to label the column names with the series variable names. 
</div>